BSP/src/Documents/_ЗаявкаНаОплату/_ЗаявкаНаОплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ЗаявкаНаОплату</name>
  <basedOn>Document._КалендарныеПлатежи</basedOn>
  <registerRecords>AccumulationRegister._ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef._КалендарныеПлатежи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef._ЦФО</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef._СтаьтяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef._Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef._Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласования</name>
    <type>
      <types>EnumRef._СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТендера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПлатежноеПоручение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригиналПолучен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайняяДатаПолученияОригинала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВторойСогласователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйСогласован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКТендеру</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаСогласования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьиДляСписка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦФОДляСписка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СогласователиДляСписка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделенияДляСписка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСогласования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапыОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВсехЭтапов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЗаявка</name>
    <type>
      <types>DocumentRef._ЗаявкаНаОплату</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПояснениеНДС</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеКонтакта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КакСвязаться</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазбивкаПоСтатьям</name>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef._ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef._СтаьтяДДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВторойСогласователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПервыйСогласовал</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВторойСогласовал</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВСчете</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BSP/src/Documents/_ЗаявкаНаОплату/Forms/ФормаЭтаповОплаты/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если 
		НЕ Параметры.Свойство("Ссылка") ИЛИ НЕ ЗначениеЗаполнено(Параметры.Ссылка) 
	Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	ДокументСсылка = Параметры.Ссылка;
	СуммаДокумента = ДокументСсылка.СуммаПлатежа;
	ДатаПервойОплаты = ДокументСсылка.ДатаОплаты;
	
КонецПроцедуры



&НаСервере
Процедура СохранитьИЗакрытьНаСервере()
	//СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("СоздаватьДокументы", Истина);
	//СтруктураПараметров.Вставить("РазбивкаНаЭтапыОплаты", РазбивкаНаЭтапыОплаты);
	//ЭтаФорма.Закрыть(СтруктураПараметров);	
КонецПроцедуры

&НаКлиенте
Процедура РазбитьНаЭтапыНаКлиенте(ТекущийЭтап = 0)
	
	Если ТекущийЭтап = 0 Тогда
		РазбивкаНаЭтапыОплаты.Очистить();
		ПервыйЭтап = 1;
	Иначе 
		ПервыйЭтап = ТекущийЭтап;	
	КонецЕсли;
	
	СуммаКРаспределению = СуммаДокумента;
	ПроцентКРаспределению = 100;
	
	Если ВариантРазбивкиНаЭтапы = "Процент" Тогда
		ЦелоеЧислоЭтапов = Цел(ПроцентКРаспределению/ПроцентЭтапа);
		КоличествоЭтаповРазбивки = ?(ЦелоеЧислоЭтапов * ПроцентЭтапа = ПроцентКРаспределению, ЦелоеЧислоЭтапов, ЦелоеЧислоЭтапов + 1);
	Иначе
		КоличествоЭтаповРазбивки = КоличествоЭтапов;
	КонецЕсли;
	
	Для Этап = 1 По КоличествоЭтаповРазбивки Цикл
		
		Если ТекущийЭтап = 0 Тогда
			НС = РазбивкаНаЭтапыОплаты.Добавить();
			Если ЗначениеЗаполнено(ДатаПервойОплаты) Тогда
				НС.ДатаОплаты	 = ДобавитьМесяц(ДатаПервойОплаты, Этап - 1);
			КонецЕсли;
			НС.НомерСтроки = Этап;
		Иначе
			НС = РазбивкаНаЭтапыОплаты[Этап - 1];
		КонецЕсли;
		
		Если Этап > ТекущийЭтап Тогда
			//пересчет сумм
			Если ВариантРазбивкиНаЭтапы = "Процент" Тогда
				НС.Процент		 = ПроцентЭтапа;
				НС.Сумма		 = Окр(СуммаДокумента * ПроцентЭтапа / 100, 2);
			Иначе
				НС.Сумма		 = Окр(СуммаКРаспределению / (КоличествоЭтаповРазбивки - ТекущийЭтап), 2);
				НС.Процент		 = НС.Сумма / СуммаДокумента * 100;
			КонецЕсли
		Иначе
			СуммаКРаспределению		 = СуммаКРаспределению - НС.Сумма;
			ПроцентКРаспределению	 = ПроцентКРаспределению - НС.Процент;
		КонецЕсли;
		
		//контроль отрицательных сумм
		СуммаОстаток 	= НС.Сумма + СуммаДокумента - РазбивкаНаЭтапыОплаты.Итог("Сумма");
		ПроцентОстаток	= НС.Процент + 100 - РазбивкаНаЭтапыОплаты.Итог("Процент");
		Если СуммаОстаток < 0 Тогда
			НС.Сумма = НС.Сумма + СуммаОстаток;	
			НС.Процент = НС.Процент + ПроцентОстаток;	
		КонецЕсли;
		
		//корректируем остаток
		Если Этап = КоличествоЭтаповРазбивки Тогда
			СуммаОстаток 	= НС.Сумма + СуммаДокумента - РазбивкаНаЭтапыОплаты.Итог("Сумма");
			ПроцентОстаток	= НС.Процент + 100 - РазбивкаНаЭтапыОплаты.Итог("Процент");
			НС.Сумма = СуммаОстаток;
			НС.Процент = ПроцентОстаток;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СоздаватьДокументы", Истина);
	СтруктураПараметров.Вставить("РазбивкаНаЭтапыОплаты", РазбивкаНаЭтапыОплаты);
	ЭтаФорма.Закрыть(СтруктураПараметров);	
//	СохранитьИЗакрытьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РазбитьНаЭтапы(Команда)
	РазбитьНаЭтапыНаКлиенте();
КонецПроцедуры


&НаКлиенте
Процедура РазбивкаНаЭтапыОплатыСуммаПриИзмененииНаКлиенте()
    НС = Элементы.РазбивкаНаЭтапыОплаты.ТекущиеДанные;
	НС.Процент	= НС.Сумма / СуммаДокумента * 100;
	РазбитьНаЭтапыНаКлиенте(НС.НомерСтроки);
КонецПроцедуры


&НаКлиенте
Процедура РазбивкаНаЭтапыОплатыСуммаПриИзменении(Элемент)
	РазбивкаНаЭтапыОплатыСуммаПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьВаринатовЭтапов()
	Элементы.КоличествоЭтапов.Видимость = НЕ ВариантРазбивкиНаЭтапы = "Процент"; 
	Элементы.КоличествоЭтапов.Доступность = НЕ ВариантРазбивкиНаЭтапы = "Процент";
	Элементы.ПроцентЭтапа.Видимость = ВариантРазбивкиНаЭтапы = "Процент"; 
	Элементы.ПроцентЭтапа.Доступность = ВариантРазбивкиНаЭтапы = "Процент";
КонецПроцедуры

&НаКлиенте
Процедура ВариантРазбивкиНаЭтапыПриИзменении(Элемент)
	ВидимостьВаринатовЭтапов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВариантРазбивкиНаЭтапы = "Количество";
	ВидимостьВаринатовЭтапов();
КонецПроцедуры
